namespace Elementary.Business
{
    public static class PlayerConsts
    {
        public static string[] SingleNames = new string[]
        {
            "Отвязные колбы",
            "Отважные витаминки",
            "Грозные алхимики",
            "Солнышковые капибары",
            "Чудесные липопротеины",
            "Опасные липопротеины",
            "Взрывные пробирки",
            "Полезные клубнички",
            "Лихие окислители",
            "Вездесущие атомы",
            "Дзеновые колбы",
            "Отчаянные исследователи"
        };

        public static string[] TeamNames = new string[]
        {
            "Отвязная колба",
            "Отважный магний",
            "Грозный алхимик",
            "Солнышковая капибара",
            "Чудесный липопротеин",
            "Опасный липопротеин",
            "Взрывная пробирка",
            "Полезная клубничка",
            "Лихой окислитель",
            "Вездесущий атом",
            "Дзеновая колба",
            "Отчаянный исследователь"
        };

        public static string[] Descriptions = new string[]
        {
            "Вы определённо умеете растворять тоску в отличном настроении (или не в нём?..). Не забудьте перемешать и приготовиться задорно решить тест!",
            "Нервная система крепка, а вы – готовы к любым свершениям! К примеру, к грядущему тесту и сессии (Перед применением витаминных добавок консультируйтесь со специалистом)",
            "Пуф! Легко трансмутируйте железо в золото или превратите врага (тест) в пепел (вашу победу)!",
            "Вы состоите из меди и теллура? Нет?! Но вы же CuTe (cute – англ. «милый»)... Признавайтесь, знания по теме семинара точно есть в вашем составе!",
            "Пф-ф, что вам этот тест! Вы легко и непринуждённо преодолеете любые трудности, неся свет (улыбнитесь!) знаний, как липопротеины высокой плотности переносят «хороший» холестерин",
            "Ву-ха-ха! *злодейский смех* Вы безудержны и коварны, как липопротеины низкой плотности, переносящие «плохой» холестерин… Перед вами никто не устоит, включая тест…",
            "Смешать прекрасность и чудесность, смышлёность и весёлость… Встряхнуть и… Буф! В ходе химической реакции образовались вы! Готовы взорвать этот тест?",
            "Вы замечательны! Потому что полны антиоксидантов, микро-/макроэлементов и... Энергии, чтоб решить тест!",
            "И-и-и-ха! Готовьтесь отлавливать верные ответы, как ковбой Марганец отлавливает электроны у восстановителей!",
            "Кто вы сегодня – сияющее золотце или «заряжающий сиянием» уран? Активный натрий или «благородный» гелий? Решать только вам! (как и тест)",
            "Вокруг взрывы, битые пробирки, сессия? Пф, а вы познали покой и умиротворение, потому невозмутимо пройдёте тест и выпьете водный экстракт ромашки (чай)!",
            "В вашей лаборатории проходит последняя стадия синтеза инновационного препарата; мысленно вы дописываете введение докторской диссертации… Для вас тест – разминка пальцев!"
        };
    }
}
