using Elementary.Controllers;

namespace Elementary.Business;

public class QuestionHolder
{
    private static Dictionary<int, List<Question>>? _questions;

    public static List<Question> GetQuestions(int level)
    {
        if (_questions == null)
        {
            _questions = new Dictionary<int, List<Question>>();
            _questions[1] = InitQuestions();
            _questions[2] = InitQuestions2();
        }
        return _questions[level];
    }

    private static List<Question> InitQuestions()
    {
        return
        [
            new()
            {
                Value = "Многие учёные пытались найти способ систематизировать химические элементы, но один из перечисленных ниже к ним не относится. Отметьте лишнего!",
                Type= "multiple",
                Options =
                [
                    "Александр де Шанкуртуа",
                    "Ларс Нильсон",
                    "Иоганн Вольфганг Дёберейнер",
                    "Джон Ньюлендс",
                    "Юлиус Лотар Мейер",
                ],
                Answer = "Ларс Нильсон",
                Explanation = "Каких только классификаций не придумали – от винтового графика де Шанкуртуа до закона октав Ньюлендса... Но Ларс Нильсон – шведский химик, открывший в 1879 году скандий («экабор»), работал уже в период развития Периодического закона Д. И. Мендлеева.",
            },

            new()
            {
                Value = "В каком году Дмитрий Менделеев открыл Периодический закон?",
                Type= "text",
                Options =
                [
                    "1859",
                    "1869",
                    "1979",
                    "1989",
                ],
                Answer = "1869",
                Explanation = "17 февраля 1869 г. – Д. И. Менделеев опубликовал её, черновой вариант таблицы... Как произошло великое открытие? Узнаете на семинаре! Спойлер: «Нет, то было не вспышка неожиданного гения или ночное откровение музы, а закономерный финал многолетнего научного поиска»...",
            },

            new()
            {
                Value = "Не зная об актуальности изучения биоантиоксидантов, Д. И. Менделеев посвятил докторскую диссертацию другой теме; впоследствии его работа стала источником мифов. Как же называлась докторская диссертация Д. И. Менделеева?",
                Type= "multiple",
                Options =
                [
                    "«Об эфирных маслах»",
                    "«О соединении спирта с водой»",
                    "«Материалы по вопросу о взаимном влиянии атомов в химических соединениях»",
                    "«Синтез новых кислород-, азот- и серосодержащих соединений дегидроабиетанового ряда»",
                ],
                Answer = "«О соединении спирта с водой»",
                Explanation = "Д. И. Менделееву приписывают изобретение водки – смеси этилового спирта с водой, но его докторская диссертация «О соединении спирта с водой» посвящена отнюдь не рецептам. О чём она – узнаете на семинаре! «Об эфирных маслах» защищена А. М. Бутлеровым, «Материалы по вопросу о взаимном влиянии атомов в химических соединениях» – В. В. Марковниковым. Кандидатскую диссертацию «Синтез новых кислород-, азот- и серосодержащих соединений дегидроабиетанового ряда» защитил наш современник, Д. В. Петухов.",
            },

            new()
            {
                Value = "В 1913 г. английский физик Генри Мозли определил, что некое число Z –фундаментальное свойство химического элемента. Позже установили, что число Z равно числу протонов в ядре атома данного элемента. Как называется число Z?",
                Type= "multiple",
                Options =
                [
                    "Валентность",
                    "Атомный номер",
                    "Главное квантовое число",
                    "Относительная атомная масса",
                ],
                Answer = "Атомный номер",
                Explanation = "Атомный номер. Какие исследования проводил Мозли и как пришёл к такому выводу – узнаете на семинаре!",
            },

            new()
            {
                Value = "За исследования в области изучения радиоактивности А. А. Беккерелю и супругам ... присудили Нобелевскую премию по физике.",
                Type= "multiple",
                Options = [],
                Answer = "Кюри",
                Explanation = "... И супругам Кюри. О том, как повлияли исследования Марии Склодовской-Кюри и её мужа Пьера Кюри на развитие химии узнаете подробнее на семинаре!",
            },

            new()
            {
                Value = "Макс Планк, Альберт Эйнштейн, Нильс Бор, Луи де Бройль, Эрвин Шрёдингер... У истоков развития какой теории стояли перечисленные учёные?",
                Type= "multiple",
                Options =
                [
                    "Теория относительности",
                    "Квантовая механика",
                    "Теория струн",
                    "Классическая механика",
                ],
                Answer = "Квантовая механика",
                Explanation = "В начале XX века физики столкнулись с новыми загадками, связанными с поведением материи на атомном уровне. Квантовая механика начала развиваться как ответ на эти проблемные вопросы.",
            },
        ];
    }

    private static List<Question> InitQuestions2()
    {
        return
        [
            //new()
            //{
            //    Value = "Многие учёные пытались найти способ систематизировать химические элементы, но один из перечисленных ниже к ним не относится. Отметьте лишнего!",
            //    Options =
            //    [
            //        "Александр де Шанкуртуа",
            //        "Ларс Нильсон",
            //        "Иоганн Вольфганг Дёберейнер",
            //        "Джон Ньюлендс",
            //        "Юлиус Лотар Мейер",
            //    ],
            //    Answer = "Ларс Нильсон",
            //    Explanation = "Каких только классификаций не придумали – от винтового графика де Шанкуртуа до закона октав Ньюлендса... Но Ларс Нильсон – шведский химик, открывший в 1879 году скандий («экабор»), работал уже в период развития Периодического закона Д. И. Мендлеева.",
            //},

            new()
            {
                Value = " Д. И. Менделеев предсказал некоторые ещё не открытые к тому времени элементы. Спустя время, химикам удалось открыть эти, ранее предсказанные, элементы. Соотнесите название элемента, предсказанный Менделеевым, с элементом, открытым позднее.",
                Type= "link",
                Options =
                [
                    "Экаалюминий",
                    "Экабор",
                    "Экасилиций",
                ],
                TargetOptions =
                [
                    "Германий",
                    "Галлий",
                    "Бор",
                    "Скандий",
                ],
                Answer = "А–2,Б–4,В–1",
                Explanation = "Поль Эмиль Лекок де Буабодран открыл галлий, который до этого Менделеев предсказал как «экаалюминий». «Экабор» соответствует открытому Ларсом Нильсоном скандию, а «Экасилиций» – германию, над открытием которого работал Клеменс Винклер. Бор – элемент, открытый ещё в 1808 году и включённый в периодическую систему Д.И. Менделеева.",
            },
        ];
    }
}
