using Elementary.Controllers;

namespace Elementary.Business;

public class QuestionHolder
{
    private static Dictionary<int, List<Question>>? _questions;

    public static List<Question> GetQuestions(int level)
    {
        if (_questions == null)
        {
            _questions = new Dictionary<int, List<Question>>();
            _questions[1] = InitQuestions();
            _questions[2] = InitQuestions2();
        }
        return _questions[level];
    }

    private static List<Question> InitQuestions()
    {
        return
        [
            new()
            {
                Value = "Многие учёные пытались найти способ систематизировать химические элементы, но один из перечисленных ниже к ним не относится. Отметьте лишнего!",
                Type= "multiple",
                Options =
                [
                    "Александр де Шанкуртуа",
                    "Ларс Нильсон",
                    "Иоганн Вольфганг Дёберейнер",
                    "Джон Ньюлендс",
                    "Юлиус Лотар Мейер",
                ],
                Answer = "Ларс Нильсон",
            },

            new()
            {
                Value = "В каком году Дмитрий Менделеев открыл Периодический закон?",
                Type= "text",
                Options =
                [
                    "1859",
                    "1869",
                    "1979",
                    "1989",
                ],
                Answer = "1869",
            },

            new()
            {
                Value = "Не зная об актуальности изучения биоантиоксидантов, Д. И. Менделеев посвятил докторскую диссертацию другой теме; впоследствии его работа стала источником мифов. Как же называлась докторская диссертация Д. И. Менделеева?",
                Type= "multiple",
                Options =
                [
                    "«Об эфирных маслах»",
                    "«О соединении спирта с водой»",
                    "«Материалы по вопросу о взаимном влиянии атомов в химических соединениях»",
                    "«Синтез новых кислород-, азот- и серосодержащих соединений дегидроабиетанового ряда»",
                ],
                Answer = "«О соединении спирта с водой»",
            },

            new()
            {
                Value = "В 1913 г. английский физик Генри Мозли определил, что некое число Z –фундаментальное свойство химического элемента. Позже установили, что число Z равно числу протонов в ядре атома данного элемента. Как называется число Z?",
                Type= "multiple",
                Options =
                [
                    "Валентность",
                    "Атомный номер",
                    "Главное квантовое число",
                    "Относительная атомная масса",
                ],
                Answer = "Атомный номер",
            },

            new()
            {
                Value = "За исследования в области изучения радиоактивности А. А. Беккерелю и супругам ... присудили Нобелевскую премию по физике.",
                Type= "text",
                Options = [],
                Answer = "Кюри",
            },

            new()
            {
                Value = "Макс Планк, Альберт Эйнштейн, Нильс Бор, Луи де Бройль, Эрвин Шрёдингер... У истоков развития какой теории стояли перечисленные учёные?",
                Type= "multiple",
                Options =
                [
                    "Теория относительности",
                    "Квантовая механика",
                    "Теория струн",
                    "Классическая механика",
                ],
                Answer = "Квантовая механика",
            },
        ];
    }

    private static List<Question> InitQuestions2()
    {
        return
        [
            new()
            {
                Value = "Многие учёные пытались найти способ систематизировать химические элементы, но один из перечисленных ниже к ним не относится. Отметьте лишнего!",
                Type= "multiple",
                Options =
                [
                    "Александр де Шанкуртуа",
                    "Ларс Нильсон",
                    "Иоганн Вольфганг Дёберейнер",
                    "Джон Ньюлендс",
                    "Юлиус Лотар Мейер",
                ],
                Answer = "Ларс Нильсон",
            },

            new()
            {
                Value = " Д. И. Менделеев предсказал некоторые ещё не открытые к тому времени элементы. Спустя время, химикам удалось открыть эти, ранее предсказанные, элементы. Соотнесите название элемента, предсказанный Менделеевым, с элементом, открытым позднее.",
                Type= "link",
                Options =
                [
                    "Экаалюминий",
                    "Экабор",
                    "Экасилиций",
                ],
                TargetOptions =
                [
                    "Германий",
                    "Галлий",
                    "Бор",
                    "Скандий",
                ],
                Answer = "241",
            },
        ];
    }
}
