namespace Elementary.Business;

public static class QuestionHolder
{
    private static Dictionary<int, List<Question>>? _questions;

    public static List<Question> GetQuestions(int level)
    {
        _questions ??= new()
        {
            [1] = InitQuestions(),
            [2] = InitQuestions2(),
        };

        return _questions[level];
    }

    private static List<Question> InitQuestions()
    {
        return
        [
            new()
            {
                Value = "Многие учёные пытались найти способ систематизировать химические элементы, но один из перечисленных ниже к ним не относится. Отметьте лишнего!",
                Type = "multiple",
                Options =
                [
                    "Александр де Шанкуртуа",
                    "Ларс Нильсон",
                    "Иоганн Вольфганг Дёберейнер",
                    "Джон Ньюлендс",
                    "Юлиус Лотар Мейер",
                ],
                Answer = "Ларс Нильсон",
            },
            new()
            {
                Value = "В каком году Д. И. Менделеев открыл Периодический закон?",
                Type = "multiple",
                Options =
                [
                    "1859",
                    "1869",
                    "1979",
                    "1989",
                ],
                Answer = "1869",
            },
            new()
            {
                Value = "Не зная об актуальности изучения антиоксидантов, Д. И. Менделеев посвятил докторскую диссертацию другой теме; впоследствии его работа стала источником мифов. Как же называлась докторская диссертация Д. И. Менделеева?",
                Type = "multiple",
                Options =
                [
                    "«Об эфирных маслах»",
                    "«О соединении спирта с водой»",
                    "«Материалы по вопросу о взаимном влиянии атомов в химических соединениях»",
                    "«Синтез новых кислород-, азот- и серосодержащих соединений дегидроабиетанового ряда»",
                ],
                Answer = "«О соединении спирта с водой»",
            },
            new()
            {
                Value = "В 1913 г. английский физик Генри Мозли определил, что некое число Z – фундаментальное свойство химического элемента. Позже установили, что число Z равно числу протонов в ядре атома данного элемента. Что обозначает число Z?",
                Type = "multiple",
                Options =
                [
                    "Валентность",
                    "Атомный номер",
                    "Главное квантовое число",
                    "Относительная атомная масса",
                ],
                Answer = "Атомный номер",
            },
            new()
            {
                Value = "За исследования в области изучения радиоактивности А. А. Беккерелю и супругам ... присудили Нобелевскую премию по физике.",
                Type = "text",
                Options = [],
                Answer = "Кюри",
            },
            new()
            {
                Value = "С позиций какой теории Нильс Бор объяснил устойчивость планетарной модели атома и одновременно закономерности спектральных линий?",
                Type = "multiple",
                Options =
                [
                    "Теория относительности",
                    "Квантовая теория",
                    "Теория струн",
                    "Классическая механика",
                ],
                Answer = "Квантовая теория",
            },
        ];
    }

    private static List<Question> InitQuestions2()
    {
        return
        [
            new()
            {
                Value = "Первая попытка периодической классификации элементов принадлежит немецкому химику …, предложившему закон триад. Заполните пропуск!",
                Type = "multiple",
                Options =
                [
                    "Леопольду Гмелину",
                    "Иоганну Вольфгангу Дёберейнеру",
                    "Юлиусу Мейеру",
                    "Вильгельму Оствальду",
                ],
                Answer = "Иоганну Вольфгангу Дёберейнеру",
            },
            new()
            {
                Value = "Экаэлементы – введённое Д. И. Менделеевым обозначение предсказанных им химических элементов, расположенных в периодической системе под соответствующими известными. Соотнесите название экаэлемента с названием элемента, полученным при открытии!",
                Type = "link",
                Options =
                [
                    "Экаалюминий",
                    "Экабор",
                    "Экасилиций",
                ],
                TargetOptions =
                [
                    "Германий",
                    "Галлий",
                    "Бор",
                    "Скандий",
                ],
                Answer = "241",
            },
            new()
            {
                Value = "«Чего только не делывал я в своей научной жизни...» – задумчиво протянул Д. И. Менделеев, увидев список, приведённый ниже. – «Но этой научной сферы в моём резюме не было». Выберите лишнее!",
                Type = "multiple",
                Options =
                [
                    "Физика",
                    "Экономика",
                    "Математика",
                    "Метрология",
                    "Геология",
                ],
                Answer = "Математика",
            },
            new()
            {
                Value = "Какой из перечисленных ниже учёных открыл закон, который экспериментально подтвердил правильность размещения элементов в периодической таблице Д. И. Менделеева?",
                Type = "multiple",
                Options =
                [
                    "Антониус ван ден Брук",
                    "Генри Мозли",
                    "Нильс Бор",
                ],
                Answer = "Генри Мозли",
            },
            new()
            {
                Value = "Алхимическая трансмутация всё-таки существует! В современной науке «трансмутация» – превращение атомов одних химических элементов в другие в результате … распада их … либо … реакций. Подберите пропущенные слова!",
                Type = "multiple",
                Options =
                [
                    "нуклонного, электронных оболочек, ядерных",
                    "радиоактивного, ядер, ядерных",
                    "радиоактивного, ядер, экзотермических",
                ],
                Answer = "радиоактивного, ядер, ядерных",
            },
            new()
            {
                Value = "Какая модель строения атома послужила основой для создания теории, которую разработал в 1913 г. Нильс Бор?",
                Type = "multiple",
                Options =
                [
                    "Кексовая модель Томсона – Томсона",
                    "Планетарная модель Резерфорда",
                    "Сферическая модель Дальтона",
                ],
                Answer = "Планетарная модель Резерфорда",
            },
        ];
    }
}
